In [1]:
import pandas as pd

In [2]:
# SERIES 
# a series is a 1-D array comtaining any type of data

In [3]:
# Creation a series
series = pd.Series([10,20,30])
print(series)

0    10
1    20
2    30
dtype: int64

In [4]:
series1 = pd.Series(['Avi' , 'Shyam' , 'Aman'] , index = [3,5,7])
print(series1)

3      Avi
5    Shyam
7     Aman
dtype: object

In [5]:
# Creation of series from numpy arrays
import numpy as np
array = np.array([1,2,3,4,5,6,7])
series2 = pd.Series(array)
print(series)

0    10
1    20
2    30
dtype: int64

In [6]:
# We can use letters or srtings as indices
series4 = pd.Series(array , index = ['Ram' , 'Sita' , 'Krishn' ,  'Radha' , "Hari" , 'Mahesh' , 'Laxmi'])
print(series4)

Ram       1
Sita      2
Krishn    3
Radha     4
Hari      5
Mahesh    6
Laxmi     7
dtype: int32

In [7]:
# Creation of series from dictionary
dict = {'India':'New Delhi' , 'UK':'London','Japan' :'Tokyo'}
# print(dict)
series5 = pd.Series(dict)
print(series5)

India    New Delhi
UK          London
Japan        Tokyo
dtype: object

In [9]:
# Creation of Datafrram from NumPy ndaarrays
array1 = np.array([10,20,30])
df1 = pd.DataFrame(array1)
df1

    0
0  10
1  20
2  30

In [10]:
# Creation of Dataframe from list of dictionaries
listdict = [{'a':20 , 'b':10}, {'a':10, 'b':15 , 'c':20}]
# we are putting two dictionaries in a list
df2 = pd.DataFrame(listdict)
df2

    a   b     c
0  20  10   NaN
1  10  15  20.0

In [17]:
# creation of dataframe from series
series1 = pd.Series([1,2,3,4,5] , index = ['a' , 'b' , 'c' , 'd' , 'e'])
series2 = pd.Series([1000,2000,-1000,-5000, 3000] , index = ['a' , 'b' , 'c' , 'd' , 'e'])
df3 = pd.DataFrame(series1)
df3.head()
df4 = pd.DataFrame([series1 , series2])
df4

      a     b     c     d     e
0     1     2     3     4     5
1  1000  2000 -1000 -5000  3000

In [19]:
# creation of dataframe fro dicc tionary of series
result = {'Arnab': pd.Series([90,91,97] , index = ['maths' , 'science' ,  'hindi']),
         'ramit' : pd.Series([92,81,96] , index = ['maths' , 'science' ,  'hindi']),
         'sahir':  pd.Series([89,91,88] , index = ['maths' , 'science' ,  'hindi']),
         'riya':  pd.Series([81,67,71] , index = ['maths' , 'science' ,  'hindi']),
          'mallika':pd.Series([94,95,99] , index = ['maths' , 'science' ,  'hindi'])}
df5 = pd.DataFrame(result)
df5

         Arnab  ramit  sahir  riya  mallika
maths       90     92     89    81       94
science     91     81     91    67       95
hindi       97     96     88    71       99

In [ ]:
# adding a new column to a Dataframe
df5['dhruv']= []